In [1]:
import pandas as pd 
import numpy as np

In [3]:
df=pd.read_csv('titanic1.csv')

In [4]:
df

    Cabin            Ticket number  Survived
0     NaN         A/5 21171      5         0
1     C85          PC 17599      3         1
2     NaN  STON/O2. 3101282      6         1
3    C123            113803      3         1
4     NaN            373450      A         0
..    ...               ...    ...       ...
886   NaN            211536      3         0
887   B42            112053      3         1
888   NaN        W./C. 6607      1         0
889  C148            111369      2         1
890   NaN            370376      3         0

[891 rows x 4 columns]

In [7]:
df.number.unique()

array(['5', '3', '6', 'A', '2', '1', '4'], dtype=object)

In [10]:
# Extract numerical part
df['numerical']=pd.to_numeric(df.number,errors='coerce',downcast='integer')

In [9]:
df

    Cabin            Ticket number  Survived  numerical
0     NaN         A/5 21171      5         0        5.0
1     C85          PC 17599      3         1        3.0
2     NaN  STON/O2. 3101282      6         1        6.0
3    C123            113803      3         1        3.0
4     NaN            373450      A         0        NaN
..    ...               ...    ...       ...        ...
886   NaN            211536      3         0        3.0
887   B42            112053      3         1        3.0
888   NaN        W./C. 6607      1         0        1.0
889  C148            111369      2         1        2.0
890   NaN            370376      3         0        3.0

[891 rows x 5 columns]

In [11]:
# extract categorical data
df['categorical'] = np.where(df.numerical.isnull(),df.number,np.nan)

In [12]:
df

    Cabin            Ticket number  Survived  numerical categorical
0     NaN         A/5 21171      5         0        5.0         NaN
1     C85          PC 17599      3         1        3.0         NaN
2     NaN  STON/O2. 3101282      6         1        6.0         NaN
3    C123            113803      3         1        3.0         NaN
4     NaN            373450      A         0        NaN           A
..    ...               ...    ...       ...        ...         ...
886   NaN            211536      3         0        3.0         NaN
887   B42            112053      3         1        3.0         NaN
888   NaN        W./C. 6607      1         0        1.0         NaN
889  C148            111369      2         1        2.0         NaN
890   NaN            370376      3         0        3.0         NaN

[891 rows x 6 columns]

In [13]:
df['cabin_num']=df['Cabin'].str.extract('(\d+)') #captures numerical part
df['cabin_cat']=df['Cabin'].str[0] #captures first letter

In [14]:
df

,Cabin,Ticket,number,Survived,numerical,categorical,cabin_num,cabin_cat
0,NaN,A/5 21171,5,0,5.0,NaN,NaN,NaN
1,C85,PC 17599,3,1,3.0,NaN,85,C
2,NaN,STON/O2. 3101282,6,1,6.0,NaN,NaN,NaN
3,C123,113803,3,1,3.0,NaN,123,C
4,NaN,373450,A,0,NaN,A,NaN,NaN
...,...,...,...,...,...,...,...,...
886,NaN,211536,3,0,3.0,NaN,NaN,NaN
887,B42,112053,3,1,3.0,NaN,42,B
888,NaN,W./C. 6607,1,0,1.0,NaN,NaN,NaN
889,C148,111369,2,1,2.0,NaN,148,C
890,NaN,370376,3,0,3.0,NaN,NaN,NaN

In [18]:
# extract the last bit of ticket as number
df['ticket_num'] = df['Ticket'].apply(lambda s: s.split()[-1])
df['ticket_num'] = pd.to_numeric(df['ticket_num'],
                                   errors='coerce',
                                   downcast='integer')

# extract the first part of ticket as category
df['ticket_cat'] = df['Ticket'].apply(lambda s: s.split()[0])
df['ticket_cat'] = np.where(df['ticket_cat'].str.isdigit(), np.nan,
                              df['ticket_cat']) #jahan pe digit hai wahan pe na krdo

In [19]:
df

,Cabin,Ticket,number,Survived,numerical,categorical,cabin_num,cabin_cat,ticket_num,ticket_cat
0,NaN,A/5 21171,5,0,5.0,NaN,NaN,NaN,21171.0,A/5
1,C85,PC 17599,3,1,3.0,NaN,85,C,17599.0,PC
2,NaN,STON/O2. 3101282,6,1,6.0,NaN,NaN,NaN,3101282.0,STON/O2.
3,C123,113803,3,1,3.0,NaN,123,C,113803.0,NaN
4,NaN,373450,A,0,NaN,A,NaN,NaN,373450.0,NaN
...,...,...,...,...,...,...,...,...,...,...
886,NaN,211536,3,0,3.0,NaN,NaN,NaN,211536.0,NaN
887,B42,112053,3,1,3.0,NaN,42,B,112053.0,NaN
888,NaN,W./C. 6607,1,0,1.0,NaN,NaN,NaN,6607.0,W./C.
889,C148,111369,2,1,2.0,NaN,148,C,111369.0,NaN
890,NaN,370376,3,0,3.0,NaN,NaN,NaN,370376.0,NaN